watd_ya_eat/app/controllers/meals_controller.rb

  def create
    @meal = Meal.new(meal_params)
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]