watd_ya_eat/app/controllers/meals_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = $1  [["user_id", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @meals = Meal.where(user_id: @user.id)

SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def show
    @meal = Meal.find(params[:id])

SELECT "slots".* FROM "slots" WHERE "slots"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "meals" ("user_id", "slot_id", "foodeaten", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["slot_id", 3], ["foodeaten", "chicken"], ["created_at", "2020-07-20 22:14:39.851902"], ["updated_at", "2020-07-20 22:14:39.851902"]]
---
  def create
    @meal = Meal.new(meal_params)

    @meal.user = @current_user
    @slot = Slot.find(params[:slot_id])
    @meal.slot_id = @slot.id
    if @meal.save

SELECT "slots".* FROM "slots" WHERE "slots"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "meals".* FROM "meals" WHERE "meals"."slot_id" = $1  [["slot_id", 9]]
---
  def slotlookup
    @slot = Slot.find(params[:slot_id])
    @meals = Meal.where(slot_id: @slot.id)

SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
UPDATE "meals" SET "foodeaten" = $1, "updated_at" = $2 WHERE "meals"."id" = $3  [["foodeaten", "apple"], ["updated_at", "2020-07-15 22:29:02.506811"], ["id", 19]]
---
  def update
    @meal = Meal.find(params[:id])
    @meal.update(meal_params)

SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
DELETE FROM "meals" WHERE "meals"."id" = $1  [["id", 29]]
---
  def destroy
    @meal = Meal.find(params[:id])
    @meal.destroy