app/controllers/slots_controller.rb

  def index
    @slots = Slot.all
---
SELECT "slots".* FROM "slots"

  def show
    @slot = Slot.find(params[:id])
---
SELECT "slots".* FROM "slots" WHERE "slots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]